Revit 2027 API
RebarCurvesData.CanAddBarGeometry Method
If the layout rule is Single or FixedNumber or NumberWithSpacing this function will return true if getNumberOfBarGeometry() is less getBarsNumber(), false otherwise.
If the layout rule is CustomSpacing, it will return true if GetNumberOfBarGeometry() is less the number of bars (specified by the formula), false otherwise.
For the other layout types, will return true.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanAddBarGeometry()
Public Function CanAddBarGeometry As Boolean
public:
bool CanAddBarGeometry()
member CanAddBarGeometry : unit -> bool
Return Value
Boolean
 Returns true if we can add more bar geometry for the current layout, false otherwise.
See Also
Reference
RebarCurvesData Class
Autodesk.Revit.DB.Structure Namespace